package com.cwgj.led_lib;


import com.cwgj.led_lib.ledproduct.OuGuanLed;

/**
 * +----------------------------------------------------------------------
 * |  说明     ：Led 生产工厂
 * +----------------------------------------------------------------------
 * | 创建者   :  ldw
 * +----------------------------------------------------------------------
 * | 时　　间 ：2018/5/17 09:54
 * +----------------------------------------------------------------------
 * | 版权所有: 北京市车位管家科技有限公司
 * +----------------------------------------------------------------------
 **/
public class FactoryLed {

    //欧冠Led
    public static final int OuGuan = 1;

    public static LedDrive getLed(int type){
        if(OuGuan == type){
            return new OuGuanLed();
        }
        return null;
    }
}
